todo_manager/app/models/todo.rb

SELECT "todos".* FROM "todos"
---
  def self.to_displayable_list
    all.map { |todo| todo.to_displayable_string }

SELECT "todos".* FROM "todos" WHERE (due_date < '2021-09-22')
SELECT "todos".* FROM "todos" WHERE (due_date > '2021-09-22')
---
  def self.show_list
    puts "My Todo-list\n\n"

    puts "Overdue\n"
    puts overdue.map { |todo| todo.to_displayable_string }
    puts "\n"

    puts "Due Today\n"
    puts due_today.map { |todo| todo.to_displayable_string }
    puts "\n\n"

    puts "Due Later\n"
    puts due_later.map { |todo| todo.to_displayable_string }