todo_manager/app/models/user.rb

  def self.to_displayable_list
    all.map { |user| user.to_displayable_string }
---
SELECT "users".* FROM "users"