todo_manager/app/controllers/todos_controller.rb

  def index
    render plain: Todo.to_displayable_list.join("\n")
---
SELECT "todos".* FROM "todos"

  def show
    id = params[:id]
    render plain: Todo.find(id).to_displayable_string
---
SELECT "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    id = params[:id]
    completed = params[:completed]
    todo = Todo.find(id)
    todo.completed = completed
    todo.save!
---
SELECT "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "todos" SET "completed" = $1 WHERE "todos"."id" = $2  [["completed", true], ["id", 7]]

  def create
    text = params[:todo_text]
    due = DateTime.parse(params[:due_date])


    newTodo = Todo.create!(todo_text: text, due_date: due, completed: false)
---
INSERT INTO "todos" ("todo_text", "due_date", "completed") VALUES ($1, $2, $3) RETURNING "id"  [["todo_text", "hello"], ["due_date", "2021-09-24"], ["completed", false]]