todo_manager/app/controllers/users_controller.rb

  def index
    render plain: User.to_displayable_list.join("\n")
---
SELECT "users".* FROM "users"

  def show
    id = params[:id]
    render plain: User.find(id).to_displayable_string
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    name = params[:name]
    email = params[:email]
    password = params[:password]

    newUser = User.create!(name: name, email: email, password: password)
---
INSERT INTO "users" ("name", "email", "password") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Nivesh"], ["email", "nivesh@gmail.com"], ["password", "123"]]

  def login
    email = params[:email]
    password = params[:password]
    user = User.find_by(email: email, password: password)
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 AND "users"."password" = $2 LIMIT $3  [["email", "nivesh@gmail.com"], ["password", "123"], ["LIMIT", 1]]